-- 공통코드 그룹 데이터 삽입
INSERT INTO common_code_group (common_code_group_description, common_code_group_name, is_active, group_code)
VALUES
    ('영화 장르', '장르', 1, '010'),
    ('TV 장르', '장르', 1, '011'),
    ('리뷰 키워드', '키워드', 1, '020');

-- 공통코드 데이터 삽입 - 영화 장르
INSERT INTO common_code (code, common_code_description, common_code_name, group_code, is_active)
VALUES
    ('01', '액션', '28', '010', 1),
    ('02', '모험', '12', '010', 1),
    ('03', '애니메이션', '16', '010', 1),
    ('04', '코미디', '35', '010', 1),
    ('05', '범죄', '80', '010', 1),
    ('06', '다큐멘터리', '99', '010', 1),
    ('07', '드라마', '18', '010', 1),
    ('08', '가족', '10751', '010', 1),
    ('09', '판타지', '14', '010', 1),
    ('10', '역사', '36', '010', 1),
    ('11', '공포', '27', '010', 1),
    ('12', '음악', '10402', '010', 1),
    ('13', '미스터리', '9648', '010', 1),
    ('14', '로맨스', '10749', '010', 1),
    ('15', 'SF', '878', '010', 1),
    ('16', 'TV 영화', '10770', '010', 1),
    ('17', '스릴러', '53', '010', 1),
    ('18', '전쟁', '10752', '010', 1),
    ('19', '서부', '37', '010', 1);

-- 공통코드 데이터 삽입 - TV 장르
INSERT INTO common_code (code, common_code_description, common_code_name, group_code, is_active)
VALUES
    ('01', '액션 & 모험', '10759', '011', 1),
    ('02', '애니메이션', '16', '011', 1),
    ('03', '코미디', '35', '011', 1),
    ('04', '범죄', '80', '011', 1),
    ('05', '다큐멘터리', '99', '011', 1),
    ('06', '드라마', '18', '011', 1),
    ('07', '가족', '10751', '011', 1),
    ('08', '키즈', '10762', '011', 1),
    ('09', '미스터리', '9648', '011', 1),
    ('10', '뉴스', '10763', '011', 1),
    ('11', '리얼리티', '10764', '011', 1),
    ('12', '과학 판타지', '10765', '011', 1),
    ('13', '연속극', '10766', '011', 1),
    ('14', '시사교양', '10767', '011', 1),
    ('15', '정치 예능', '10768', '011', 1),
    ('16', '서부', '37', '011', 1);

-- 공통코드 데이터 삽입 - 키워드
INSERT INTO common_code (code, common_code_description, common_code_name, group_code, is_active)
VALUES
    ('01', '긍정', '감동적인', '020', 1),
    ('02', '긍정', '재미있는', '020', 1),
    ('03', '긍정', '몰입감 있는', '020', 1),
    ('04', '긍정', '연기력이 뛰어난', '020', 1),
    ('05', '긍정', '연출이 뛰어난', '020', 1),
    ('06', '부정', '지루한', '020', 1),
    ('07', '부정', '연기가 어색한', '020', 1),
    ('08', '부정', '연출이 어색한', '020', 1),
    ('09', '부정', '전개가 느린', '020', 1),
    ('10', '부정', '기대 이하의', '020', 1);
